In [15]:
"""L'algèbre relationnelle est une théorie permettant de manipuler des données disposées sous forme de tableau ; 
et ça tombe bien : un dataframe, c'est justement un tableau !"""

"L'algèbre relationnelle est une théorie permettant de manipuler des données disposées sous forme de tableau ; \net ça tombe bien : un dataframe, c'est justement un tableau !"

In [ ]:
#Plus précisément, l'algèbre relationnelle définit des opérations sur ces tableaux.
#Elles sont regroupables en 5 grandes catégories :
# - La projection et la restriction
# - Les opérations ensemblistes (union, différence, intersection)
# - Le produit cartésien
# - Les jointures
# - L'agrégation

In [1]:
import numpy as np
import pandas as pd
import seaborn as sn

In [2]:
#Series et Dataframe
#respectivement, extesion des tableaux unidimentionnels et bi dimentionnels de numpy
#la grosse différence est que dans pandas les objets ont, en plus, une sorte d'indice explicite (chiffre, texte etc)

In [8]:
#Serie
# On peut créer une Series à partir d'une liste
ser = pd.Series([1, 2, 3], index=["a", "b", 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [4]:
data = [{"a":i, "b":2*i} for i in range(3)]
#revoir dictionnaire

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   a  b
0  0  0
1  1  2
2  2  4

In [9]:
ser.loc["b"]

2

In [10]:
ser.iloc[1]

2

In [24]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
print("data ressemble à un tableau Numpy: ", data)
print()

# On peut spécifier des indices à la main
data = pd.Series([0.25, 0.5, 0.75, 1.0],
         index=['a', 'b', 'c', 'd'])
print()
print("data ressemble à un dict en Python: ", data)
print()
print("le restultat de data['b'] est", data['b'])
print()

# On peut même créer une Serie directement à partir d'une dict
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
area_dict = {'California': 423967, 
             'Texas': 695662,
             'New York': 141297, 
             'Florida': 170312,
             'Illinois': 149995}
population = pd.Series(population_dict)
area = pd.Series(area_dict)
print(population)
print()
# Que pensez vous de cette ligne?
# Elle présente de la California à Illinois
print(population['California':'Florida'])

data ressemble à un tableau Numpy:  0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64


data ressemble à un dict en Python:  a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

le restultat de data['b'] est 0.5

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

In [25]:
"""De la même façon que les opérations sur les tableaux Numpy sont plus rapides que celles sur les list en Python, les opérations sur les Series sont plus rapides que celles sur les dict."""

'De la même façon que les opérations sur les tableaux Numpy sont plus rapides que celles sur les list en Python, les opérations sur les Series sont plus rapides que celles sur les dict.'

In [28]:
# A partir d'une Series
df = pd.DataFrame(population, columns=['population'])
print(df)

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [29]:
# A partir d'une list de dict
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
df = pd.DataFrame(data)
print(df)

   a  b
0  0  0
1  1  2
2  2  4

In [30]:
# A partir de plusieurs Series
df = pd.DataFrame({'population': population,
              'area': area})
print(df)

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [31]:
# A partir d'un tableau Numpy de dimension 2
df = pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])
print(df)

        foo       bar
a  0.373703  0.596848
b  0.521313  0.143270
c  0.348213  0.787834

In [32]:
# Une fonction pour générer facilement des DataFrame. 
# Elle nous sera utile dans la suite de ce chapitre.
def make_df(cols, ind):
    """Crée rapidement des DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

In [33]:
# exemple
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [34]:
#La projection et la restriction

In [35]:
#projection : sélection de certaines colonnes
#restriction : sélection de certaines lignes.

In [36]:
"""On peut référer aux éléments des objets Pandas en utilisant soit leurs index implicites (de la même façon que les tableaux Numpy) soit les index explicites (comme dans les dict). Pour éviter toute confusion, il est conseillé d'utiliser les attributs  loc  (qui référence par l'index) et  iloc  (qui référence par la position) de chaque objet."""

"On peut référer aux éléments des objets Pandas en utilisant soit leurs index implicites (de la même façon que les tableaux Numpy) soit les index explicites (comme dans les dict). Pour éviter toute confusion, il est conseillé d'utiliser les attributs  loc  (qui référence par l'index) et  iloc  (qui référence par la position) de chaque objet."

In [38]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])

print(data)

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [39]:
# On peut désigner un élément d'une Series par son index
print(data.loc['b'])

0.5

In [40]:
# Ou bien par sa position
print(data.iloc[1])
#On oublie pas que ça commence par 0

0.5

In [41]:
data = pd.DataFrame({'area':area, 'pop':population})
print(data)

data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [42]:
data.loc[:'Texas', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193

In [43]:
#L'union --> créer un troisième tableau qui contient toutes les lignes du premier et toutes les lignes du second
#on utilise concat !

In [44]:
#Pour une series
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [48]:
#Pour un DataFrame
df1 = make_df('AB', [1, 2])
print(df1)

    A   B
1  A1  B1
2  A2  B2

In [50]:
df2 = make_df('AB', [3, 4])
print(df2)

    A   B
3  A3  B3
4  A4  B4

In [51]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [55]:
#Par défaut,  pd.concat  assemble ses arguments "verticalement".
#Pour changer ce comportement, on peut utiliser l'argument  axis.
pd.concat([df1, df2], axis=1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [56]:
"""La concaténation préserve les index ! Par exemple, si les deux DataFrames donnés en arguments ont des index en commun, le résultat final aura des index dupliqués."""

'La concaténation préserve les index ! Par exemple, si les deux DataFrames donnés en arguments ont des index en commun, le résultat final aura des index dupliqués.'

In [58]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # Rend les index identiques
# Nous avons alors des index dupliqués
print(pd.concat([x, y]))

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [59]:
# Nous pouvons spécifier des index hiérarchiques
hdf = pd.concat([x, y], keys=['x', 'y'])
print(hdf)

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [60]:
#Pour accéder à un élément d'un objet Pandas avec un index hiérarchique, il suffit de spécifier plusieurs index. 
hdf.loc[('x', 1),]
#Some more on concat : https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

A    A1
B    B1
Name: (x, 1), dtype: object

In [62]:
#La jointure --> assembler les informations d'un tableau A avec celles d'un autre tableau B selon un  critère choisi.
#condition de jointure : une ou plusieurs colonnes communes à A et B qui effectuent une correspondance entre les 2 tableaux

In [64]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR']})
print(df1)

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [65]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})
print(df2)

  employee  date
0     Lisa  2004
1      Bob  2008
2     Jake  2012
3      Sue  2014

In [67]:
df3 = pd.merge(df1, df2)
print(df3)

#La fonction  pd.merge  a automatiquement reconnu que la colonne employee était commune aux deux Dataframes,
# elle l'a utilisée comme condition de jointure.

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [68]:
"""En effectuant une jointure, il est préférable de toujours faire attention à la cardinalité de la relation entre A et B afin d'évider certaines erreurs."""

"En effectuant une jointure, il est préférable de toujours faire attention à la cardinalité de la relation entre A et B afin d'évider certaines erreurs."

In [70]:
#3 cardinalités différentes :
# - Un-à-un (one-to-one) : lorsque qu'une ligne quelconque du tableau A correspond à une unique ligne du tableau B,
    #et qu'une ligne de B correspond à une unique ligne du tableau A.

# - Un-à-plusieurs (one-to-many) : quand une ligne quelconque de A correspond à une ligne de B,
    #mais qu'une ligne de B peut correspondre à plusieurs lignes de A.

# - Plusieurs-à-plusieurs (many-to-many) : quand une ligne de A peut correspondre à plusieurs lignes de B,
    #et qu'une ligne de B peut correspondre à plusieurs lignes de A.
    
#merge ne fait pas la différence entre ces 3 cardinalités : elle s'utilise exactement de la même manière dans les 3 cas.

In [79]:
#un à un

In [80]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR']})
print(df1)

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [75]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})
print(df2)

  employee  date
0     Lisa  2004
1      Bob  2008
2     Jake  2012
3      Sue  2014

In [76]:
df3 = pd.merge(df1, df2)
df3

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [78]:
#un à plusieurs

In [83]:
df4 = pd.DataFrame({'department': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
print(df4)

    department supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [84]:
#Un employé n'a qu'un seul chef, mais un chef peut diriger plusieurs empoyés

In [85]:
pd.merge(df3, df4)

  employee   department  date supervisor
0      Bob   Accounting  2008      Carly
1     Jake  Engineering  2012      Guido
2     Lisa  Engineering  2004      Guido
3      Sue           HR  2014      Steve

In [86]:
#plusieurs à plusieurs

In [87]:
df5 = pd.DataFrame({'department': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'competence': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
print(df5)

    department    competence
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [88]:
#un employé a besoin de plusieurs compétences, et une compétence peut être partagée par plusieurs employés.

In [89]:
pd.merge(df1, df5)

  employee   department    competence
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [ ]:
#jointure externe

In [90]:
df6 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue', 'Lea'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'Engineering']})
print(df6)

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4      Lea  Engineering

In [91]:
print(df2)

  employee  date
0     Lisa  2004
1      Bob  2008
2     Jake  2012
3      Sue  2014

In [92]:
pd.merge(df6, df2)

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [94]:
#Lea a disparu (haha :'( )
"""Effectivement. Comme Lea est présente dans df6 mais pas dans df2, elle n’apparaît pas dans le résultat de la jointure... Pour spécifier que l'on veut garder tous les éléments de dataframe de gauche (ici df6), il faut alors écrire la ligne suivante :"""

"Effectivement. Comme Lea est présente dans df6 mais pas dans df2, elle n’apparaît pas dans le résultat de la jointure... Pour spécifier que l'on veut garder tous les éléments de dataframe de gauche (ici df6), il faut alors écrire la ligne suivante :"

In [96]:
pd.merge(df6, df2, how="left")
#pour garder toutes les lignes de la droite : how="right"
#toutes les lignes tout court : how="outer"
# respectivement jointure externe à gauche, jointure externe à droite et jointure externe totale

  employee   department    date
0      Bob   Accounting  2008.0
1     Jake  Engineering  2012.0
2     Lisa  Engineering  2004.0
3      Sue           HR  2014.0
4      Lea  Engineering     NaN

In [97]:
#Le produit cartésien

In [98]:
# Nous ajoutons une nouvelle colonne à df1 et df2, qui contient toujours
# la même valeur, ici 0.
df1['key'] = 0
df2['key'] = 0

In [102]:
print(df1)

  employee   department  key
0      Bob   Accounting    0
1     Jake  Engineering    0
2     Lisa  Engineering    0
3      Sue           HR    0

In [99]:
print(df2)

  employee  date  key
0     Lisa  2004    0
1      Bob  2008    0
2     Jake  2012    0
3      Sue  2014    0

In [100]:
# La jointure plusieurs-à-plusieurs
produit_cartesien = pd.merge(df1, df2, on='key')
print(produit_cartesien)

   employee_x   department  key employee_y  date
0         Bob   Accounting    0       Lisa  2004
1         Bob   Accounting    0        Bob  2008
2         Bob   Accounting    0       Jake  2012
3         Bob   Accounting    0        Sue  2014
4        Jake  Engineering    0       Lisa  2004
5        Jake  Engineering    0        Bob  2008
6        Jake  Engineering    0       Jake  2012
7        Jake  Engineering    0        Sue  2014
8        Lisa  Engineering    0       Lisa  2004
9        Lisa  Engineering    0        Bob  2008
10       Lisa  Engineering    0       Jake  2012
11       Lisa  Engineering    0        Sue  2014
12        Sue           HR    0       Lisa  2004
13        Sue           HR    0        Bob  2008
14        Sue           HR    0       Jake  2012
15        Sue           HR    0        Sue  2014

In [101]:
# Effaçons la colonne key qui n'est plus utile
produit_cartesien.drop('key',1, inplace=True)
print(produit_cartesien)

   employee_x   department employee_y  date
0         Bob   Accounting       Lisa  2004
1         Bob   Accounting        Bob  2008
2         Bob   Accounting       Jake  2012
3         Bob   Accounting        Sue  2014
4        Jake  Engineering       Lisa  2004
5        Jake  Engineering        Bob  2008
6        Jake  Engineering       Jake  2012
7        Jake  Engineering        Sue  2014
8        Lisa  Engineering       Lisa  2004
9        Lisa  Engineering        Bob  2008
10       Lisa  Engineering       Jake  2012
11       Lisa  Engineering        Sue  2014
12        Sue           HR       Lisa  2004
13        Sue           HR        Bob  2008
14        Sue           HR       Jake  2012
15        Sue           HR        Sue  2014

In [103]:
#En version écriture condenser de précédentes cellules
pd.merge(df1.assign(key=0), df2.assign(key=0), on='key').drop('key', axis=1)

   employee_x   department employee_y  date
0         Bob   Accounting       Lisa  2004
1         Bob   Accounting        Bob  2008
2         Bob   Accounting       Jake  2012
3         Bob   Accounting        Sue  2014
4        Jake  Engineering       Lisa  2004
5        Jake  Engineering        Bob  2008
6        Jake  Engineering       Jake  2012
7        Jake  Engineering        Sue  2014
8        Lisa  Engineering       Lisa  2004
9        Lisa  Engineering        Bob  2008
10       Lisa  Engineering       Jake  2012
11       Lisa  Engineering        Sue  2014
12        Sue           HR       Lisa  2004
13        Sue           HR        Bob  2008
14        Sue           HR       Jake  2012
15        Sue           HR        Sue  2014

In [104]:
#Le produit cartésien est composé de toutes les associations possibles entre les lignes de df1 et celles de df2. 
#Ici, avec nos données, le produit cartésien n'a cependant pas beaucoup de sens...

In [105]:
#Agrégation

In [ ]:
#version Séries

In [108]:
rng = np.random.RandomState(42)
#exposes a number of methods for generating random numbers drawn from a variety of probability distributions.
#hhhhhmmmmmmmmmmmmmmmmmmmm oookkkkaaayyyyy
print(rng)
print()

# Une Series avec cinq nombres aléatoires
ser = pd.Series(rng.rand(5))
print(ser)
print()
print(ser.sum())
print(ser.mean())

RandomState(MT19937)

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

2.811925491708157
0.5623850983416314

In [109]:
#Version Df

In [111]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
print(df)
print()
                   
# Par colonne
print(df.mean())
print()

# Par ligne
print(df.mean(axis='columns'))

          A         B
0  0.183405  0.611853
1  0.304242  0.139494
2  0.524756  0.292145
3  0.431945  0.366362
4  0.291229  0.456070

A    0.347115
B    0.373185
dtype: float64

0    0.397629
1    0.221868
2    0.408451
3    0.399153
4    0.373650
dtype: float64

In [118]:
#Revoir cette partie là qui compare SQL et PANDA
#https://openclassrooms.com/fr/courses/4452741-decouvrez-les-librairies-python-pour-la-data-science/5559346-effectuez-les-operations-dalgebre-relationnelle-sur-les-dataframes
#Juste avant la fin de chap

In [112]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': [10,11,10,9,10,10]})                  
print(df)

  key  data1  data2
0   A      0     10
1   B      1     11
2   C      2     10
3   A      3      9
4   B      4     10
5   C      5     10

In [114]:
gb = df.groupby('key')
print(gb)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001D619B05520>

In [115]:
print(gb.sum())
print(gb.mean())

     data1  data2
key
A        3     19
B        5     21
C        7     20
     data1  data2
key
A      1.5    9.5
B      2.5   10.5
C      3.5   10.0

In [116]:
s = gb['data1','data2'].sum()
m = gb['data2',].mean()

groupped = pd.concat([s,m], axis=1)
groupped.columns = ["data1_somme","data2_somme","data2_moyenne"]

<ipython-input-116-121d820de931>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  s = gb['data1','data2'].sum()

SyntaxError: invalid syntax (<ipython-input-117-1a7437e5875b>, line 1)